Terraform plan in __Terraform__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.do_challenge will be created
  + resource "digitalocean_kubernetes_cluster" "do_challenge" {
      + auto_upgrade   = true
      + cluster_subnet = (known after apply)
      + created_at     = (known after apply)
      + endpoint       = (known after apply)
      + ha             = false
      + id             = (known after apply)
      + ipv4_address   = (known after apply)
      + kube_config    = (sensitive value)
      + name           = "do-challenge-cluster"
      + region         = "sfo3"
      + service_subnet = (known after apply)
      + status         = (known after apply)
      + surge_upgrade  = true
      + updated_at     = (known after apply)
      + urn            = (known after apply)
      + version        = "1.21.5-do.0"
      + vpc_uuid       = "3921a0b6-7495-439d-b11a-e79172832979"

      + maintenance_policy {
          + day        = "sunday"
          + duration   = (known after apply)
          + start_time = "01:00"
        }

      + node_pool {
          + actual_node_count = (known after apply)
          + auto_scale        = true
          + id                = (known after apply)
          + max_nodes         = 5
          + min_nodes         = 1
          + name              = "cluster-node-pool"
          + nodes             = (known after apply)
          + size              = "s-2vcpu-4gb"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Create terraform apply for Kubernetes cluster #5](https://github.com/davidjameshowell/do-12-2021-challenge/actions/runs/1561616309)